app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index

      if params[:artist_id]
        artist = Artist.exists?(params[:artist_id])

        if artist
          @songs = Artist.find(params[:artist_id]).songs
        else
          flash[:alert] = "Artist not found"
          redirect_to artists_path
        end
      else
        @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if params[:artist_id]
      song = Song.exists?(params[:id])
      if song
        @song = Artist.find(params[:artist_id]).songs.find(params[:id])